## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1` |
|        | `aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2` |
|        | `aws_route53_health_check.lb_web_app_global_target_group`     |
|        | `aws_route53_health_check.lb_web_app_target_group_1`          |
|        | `aws_route53_health_check.lb_web_app_target_group_2`          |
| update | `aws_route53_record.form_viewer[0]`                           |
|        | `module.waf_ip_blocklist.aws_lambda_function.ipv4_blocklist`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1 will be created
  + resource "aws_cloudwatch_metric_alarm" "UnHealthyHostCount-TargetGroup1" {
      + actions_enabled                       = true
      + alarm_description                     = "App LB Warning - unhealthy host count >= 1 in a 1 minute period for TargetGroup1"
      + alarm_name                            = "App-UnHealthyHostCount-TargetGroup1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/form-viewer/ef2ad28d416e7d87"
          + "TargetGroup"  = "targetgroup/form-viewer/8dac72758c8ecdcc"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2 will be created
  + resource "aws_cloudwatch_metric_alarm" "UnHealthyHostCount-TargetGroup2" {
      + actions_enabled                       = true
      + alarm_description                     = "App LB Warning - unhealthy host count >= 1 in a 1 minute period for TargetGroup2"
      + alarm_name                            = "App-UnHealthyHostCount-TargetGroup2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/form-viewer/ef2ad28d416e7d87"
          + "TargetGroup"  = "targetgroup/form-viewer-2/a03ac97959b5fb63"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # aws_route53_health_check.lb_web_app_global_target_group will be created
  + resource "aws_route53_health_check" "lb_web_app_global_target_group" {
      + arn                    = (known after apply)
      + child_health_threshold = 1
      + child_healthchecks     = (known after apply)
      + disabled               = false
      + enable_sni             = (known after apply)
      + failure_threshold      = (known after apply)
      + id                     = (known after apply)
      + measure_latency        = false
      + reference_name         = "Active LB Tar Group health"
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type                   = "CALCULATED"
    }

  # aws_route53_health_check.lb_web_app_target_group_1 will be created
  + resource "aws_route53_health_check" "lb_web_app_target_group_1" {
      + arn                             = (known after apply)
      + cloudwatch_alarm_name           = "App-UnHealthyHostCount-TargetGroup1"
      + cloudwatch_alarm_region         = "ca-central-1"
      + disabled                        = false
      + enable_sni                      = (known after apply)
      + failure_threshold               = (known after apply)
      + id                              = (known after apply)
      + insufficient_data_health_status = "Unhealthy"
      + measure_latency                 = false
      + reference_name                  = "LB Tar Group 1 health"
      + tags_all                        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type                            = "CLOUDWATCH_METRIC"
    }

  # aws_route53_health_check.lb_web_app_target_group_2 will be created
  + resource "aws_route53_health_check" "lb_web_app_target_group_2" {
      + arn                             = (known after apply)
      + cloudwatch_alarm_name           = "App-UnHealthyHostCount-TargetGroup2"
      + cloudwatch_alarm_region         = "ca-central-1"
      + disabled                        = false
      + enable_sni                      = (known after apply)
      + failure_threshold               = (known after apply)
      + id                              = (known after apply)
      + insufficient_data_health_status = "Unhealthy"
      + measure_latency                 = false
      + reference_name                  = "LB Tar Group 2 health"
      + tags_all                        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type                            = "CLOUDWATCH_METRIC"
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
      + health_check_id                  = (known after apply)
        id                               = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A_form_viewer_forms-formulaires.alpha.canada.ca_primary"
        name                             = "forms-formulaires.alpha.canada.ca"
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.waf_ip_blocklist.aws_lambda_function.ipv4_blocklist will be updated in-place
  ~ resource "aws_lambda_function" "ipv4_blocklist" {
        id                             = "ipv4_blocklist_forms_app"
      ~ last_modified                  = "2024-12-10T14:12:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "x+q+cCA6WdzkkfRRAAH785MD20xSWJM6+iYOPe/0x+U=" -> "Zy2KGIz6OR3Yga3FDGnK+p/cWEYSI+ZLEtKYiVBVgqw="
        tags                           = {
            "CostCentre" = "forms"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + unhealthy_host_count_for_target_group_1_alarm_arn = (known after apply)
  + unhealthy_host_count_for_target_group_2_alarm_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer_maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.forms_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.forms_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_https"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.forms_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.lb_web_app_global_target_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.lb_web_app_target_group_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.lb_web_app_target_group_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main -...
```

</details>
